In [1]:
import pandas as pd

In [5]:
from google.colab import files
files.upload()

Saving stock_data.csv to stock_data.csv

{'stock_data.csv': b'tickers,eps,revenue,price,people,\r\nGOOGL,27.82,87,845,larry page,\r\nWMT,4.61,484,65,n.a.,\r\nMSFT,-1,85,64,bill gates,\r\nRIL,not available,50,1023,mukesh ambani,\r\nTATA,5.6,-1,n.a.,ratan tata,\r\n'}

In [6]:
df = pd.read_csv("stock_data.csv")
df

  tickers            eps  revenue price         people  Unnamed: 5
0   GOOGL          27.82       87   845     larry page         NaN
1     WMT           4.61      484    65           n.a.         NaN
2    MSFT             -1       85    64     bill gates         NaN
3     RIL  not available       50  1023  mukesh ambani         NaN
4    TATA            5.6       -1  n.a.     ratan tata         NaN

In [7]:
df = pd.read_csv("stock_data.csv", skiprows=1)
df

  GOOGL          27.82   87   845     larry page  Unnamed: 5
0   WMT           4.61  484    65           n.a.         NaN
1  MSFT             -1   85    64     bill gates         NaN
2   RIL  not available   50  1023  mukesh ambani         NaN
3  TATA            5.6   -1  n.a.     ratan tata         NaN

In [8]:
df = pd.read_csv("stock_data.csv", header=1) # skiprows and header are kind of same
df

  GOOGL          27.82   87   845     larry page  Unnamed: 5
0   WMT           4.61  484    65           n.a.         NaN
1  MSFT             -1   85    64     bill gates         NaN
2   RIL  not available   50  1023  mukesh ambani         NaN
3  TATA            5.6   -1  n.a.     ratan tata         NaN

In [9]:
df = pd.read_csv("stock_data.csv", header=None, names = ["ticker","eps","revenue","people"])
df

                        ticker    eps        revenue  people
tickers eps            revenue  price         people     NaN
GOOGL   27.82               87    845     larry page     NaN
WMT     4.61               484     65           n.a.     NaN
MSFT    -1                  85     64     bill gates     NaN
RIL     not available       50   1023  mukesh ambani     NaN
TATA    5.6                 -1   n.a.     ratan tata     NaN

In [10]:
df = pd.read_csv("stock_data.csv",  nrows=2)
df

  tickers    eps  revenue  price      people  Unnamed: 5
0   GOOGL  27.82       87    845  larry page         NaN
1     WMT   4.61      484     65        n.a.         NaN

In [11]:
df = pd.read_csv("stock_data.csv", na_values=["n.a.", "not available"])
df

  tickers    eps  revenue   price         people  Unnamed: 5
0   GOOGL  27.82       87   845.0     larry page         NaN
1     WMT   4.61      484    65.0            NaN         NaN
2    MSFT  -1.00       85    64.0     bill gates         NaN
3     RIL    NaN       50  1023.0  mukesh ambani         NaN
4    TATA   5.60       -1     NaN     ratan tata         NaN

In [12]:
df = pd.read_csv("stock_data.csv",  na_values={
        'eps': ['not available'],
        'revenue': [-1],
        'people': ['not available','n.a.']
    })
df

  tickers    eps  revenue price         people  Unnamed: 5
0   GOOGL  27.82     87.0   845     larry page         NaN
1     WMT   4.61    484.0    65            NaN         NaN
2    MSFT  -1.00     85.0    64     bill gates         NaN
3     RIL    NaN     50.0  1023  mukesh ambani         NaN
4    TATA   5.60      NaN  n.a.     ratan tata         NaN

In [13]:
df.to_csv("new.csv", index=False)

In [14]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people', 'Unnamed: 5'], dtype='object')

In [15]:
df.to_csv("new.csv",header=False)

In [16]:
df.to_csv("new.csv", columns=["tickers","price"], index=False)

In [28]:
df = pd.read_excel("stock_data.xlsx","Sheet1")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [27]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return 'Sam Walton'
    return cell
def convert_price_cell(cell):
    if cell=="n.a.":
        return 50
    return cell
df = pd.read_excel("stock_data.xlsx","Sheet1", converters= {
        'people': convert_people_cell,
        'price': convert_price_cell
    })
df

  tickers            eps  revenue  price         people
0   GOOGL          27.82       87    845     larry page
1     WMT           4.61      484     65     Sam Walton
2    MSFT             -1       85     64     bill gates
3    RIL   not available       50   1023  mukesh ambani
4    TATA            5.6       -1     50     ratan tata

In [19]:
df.to_excel("new.xlsx", sheet_name="stocks", index=False, startrow=2, startcol=1)

In [20]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

In [21]:
df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [22]:
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")